UNK
 
!
"
#
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
@
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
\
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~
°
±
·
×
è
÷
ō
ˉ
Β
Γ
Η
Ρ
Σ
Τ
Χ
Ω
α
β
γ
δ
ζ
θ
ι
κ
λ
μ
ν
ρ
σ
φ
Д
Ч
Ш
Щ
а
б
г
е
у
–
―
‰
′
※
℃
℅
Ⅰ
Ⅱ
Ⅲ
Ⅳ
Ⅴ
Ⅵ
Ⅶ
Ⅹ
ⅰ
ⅲ
ⅴ
ⅹ
↑
→
↓
↖
∏
∕
√
∞
∥
∧
∩
∪
∵
∶
∷
∽
≈
≤
≥
⊙
⊥
⌒
①
②
③
④
⑤
⑥
⑦
⑩
⑴
⑵
⑿
⒁
⒃
⒆
⒈
⒉
⒔
─
━
┒
┗
┙
┠
┦
┩
┪
┮
┯
┻
╥
╯
╰
╳
▂
▲
○
●
★
♀
⺁
、
。
〇
〈
〉
「
」
『
』
〒
ぃ
こ
ず
の
ぱ
ろ
ソ
ッ
ヅ
ニ
ノ
ハ
プ
ー
ㄉ
ㄋ
㈠
㎎
㎏
㎜
㎝
一
丁
七
丄
丅
万
丈
上
下
丌
不
与
丐
丑
专
且
丕
世
丘
丙
业
丛
东
丝
両
丢
两
严
丧
丨
个
丫
中
丰
串
临
丶
丸
丹
为
主
丽
举
丿
乀
乂
乃
乄
久
么
义
之
乌
乍
乎
乏
乐
乒
乓
乔
乖
乘
乙
乛
乜
九
乞
也
习
乡
书
乨
买
乱
乳
乿
亅
了
亇
予
争
亊
事
二
于
亏
云
互
亓
五
井
亚
些
亟
亡
亢
亣
交
亦
产
亨
亩
享
京
亭
亮
亱
亲
亳
人
亿
什
仁
仂
仃
仅
仆
仇
今
介
仍
从
仐
仑
仓
仔
仕
他
仗
付
仙
仟
代
令
以
仨
仪
仫
们
仰
仲
件
价
任
仼
份
仿
企
伆
伉
伊
伍
伏
伐
休
众
优
伙
会
伛
伞
伟
传
伢
伤
伦
伧
伪
伫
伯
估
伲
伴
伶
伸
伺
似
伽
佂
佃
但
位
低
住
佐
佑
体
佔
何
佗
佘
余
佛
作
佝
你
佣
佥
佩
佬
佯
佰
佳
佷
佼
佽
使
侃
侄
侈
例
侍
侎
侏
侓
侗
供
依
侠
侣
侥
侦
侧
侨
侬
侮
侯
侳
侵
便
促
俄
俊
俏
俐
俑
俗
俘
保
俞
信
俩
俪
俭
修
俯
俱
俳
俺
俾
倍
倏
倒
倔
倕
倘
候
倚
倜
借
倡
倥
倦
倩
倪
倭
倵
债
值
倾
偂
偃
假
偈
偌
偏
做
停
健
偶
偷
偻
偾
偿
傅
傍
傎
傗
傥
储
傩
催
傲
傻
僈
像
僖
僚
僣
僦
僧
僪
僵
僻
儋
儒
儗
儿
兀
允
元
兄
充
兆
先
光
克
免
兑
兔
兖
党
兜
兢
入
全
八
公
六
兮
兰
共
关
兴
兵
其
具
典
兹
养
兼
兽
冀
冂
冃
内
冇
冈
冉
冋
册
再
冏
冐
冑
冒
冕
冖
冗
写
军
农
冠
冤
冥
冦
冬
冯
冰
冲
决
况
冶
冷
冸
冻
冼
净
凃
凄
准
凉
凊
凋
凌
减
凑
凝
几
凡
凣
凤
処
凫
凭
凯
凰
凳
凶
凸
凹
出
击
函
凿
刀
刁
刃
刅
分
切
刊
刑
划
列
刘
则
刚
创
初
删
判
刨
利
别
刭
刮
到
制
刷
券
刹
刺
刻
剁
剂
剃
剈
削
剌
前
剐
剑
剔
剖
剜
剞
剥
剧
剩
剪
副
割
剿
劈
力
劝
办
功
加
务
劣
动
助
努
劫
励
劲
劳
劷
効
势
勃
勄
勇
勉
勋
勎
勐
勒
勖
勘
募
勤
勺
勾
勿
匀
包
匆
匈
匍
匏
匐
匕
化
北
匙
匛
匝
匠
匡
匣
匦
匪
匮
匹
区
医
匾
匿
十
千
卅
升
午
卉
半
华
协
卑
卒
卓
单
卖
南
博
卜
卞
卟
占
卡
卢
卤
卦
卧
卫
卮
卯
印
危
即
却
卵
卷
卸
卿
厂
厄
厅
历
厉
压
厌
厕
厘
厚
厝
原
厡
厢
厥
厦
厨
厶
厷
厸
去
县
叁
参
又
叉
及
友
双
反
发
叔
取
受
变
叙
叛
叟
口
古
句
另
叨
叩
只
叫
召
叭
叮
可
台
叱
史
右
叶
号
司
叹
叻
叼
叽
吁
吃
各
吆
合
吉
吊
吋
同
名
后
吏
吐
向
吒
吓
吕
吖
吗
君
吝
吞
吟
吠
吡
吥
否
吧
吨
吩
含
听
吭
吮
启
吱
吲
吴
吵
吸
吹
吻
吼
吾
吿
呀
呃
呆
呈
告
呋
呐
呑
呒
呓
呔
呕
呗
员
呙
呛
呜
呡
呢
呤
呦
周
呱
呲
味
呴
呵
呶
呷
呸
呻
呼
命
咀
咁
咂
咄
咆
咈
咉
咋
和
咎
咏
咐
咒
咔
咕
咖
咗
咙
咚
咛
咜
咣
咦
咧
咨
咩
咪
咬
咮
咯
咱
咳
咶
咸
咻
咽
咿
哀
品
哂
哃
哄
哆
哇
哈
哌
响
哎
哏
哐
哑
哒
哕
哗
哚
哝
哟
哥
哦
哧
哨
哩
哪
哫
哭
哮
哲
哹
哺
哼
哽
哾
唃
唆
唇
唉
唍
唐
唑
唔
唠
唢
唤
唧
唬
售
唯
唰
唱
唷
唻
唾
唿
啃
啄
商
啉
啊
啌
啍
啐
啕
啖
啜
啡
啤
啥
啦
啧
啪
啫
啬
啯
啰
啵
啶
啷
啸
啼
啾
喀
喁
喂
喃
善
喇
喉
喊
喋
喏
喑
喔
喘
喛
喜
喝
喟
喧
喨
喱
喳
喷
喹
喻
喽
嗄
嗅
嗉
嗌
嗑
嗒
嗓
嗔
嗖
嗜
嗝
嗡
嗣
嗤
嗦
嗨
嗪
嗮
嗯
嗲
嗳
嗷
嗽
嗾
嘀
嘈
嘉
嘌
嘎
嘘
嘚
嘛
嘞
嘟
嘢
嘣
嘤
嘧
嘬
嘭
嘱
嘲
嘴
嘶
嘻
嘿
噈
噌
噎
噐
噔
噗
噘
噙
噜
噢
噤
器
噩
噪
噫
噬
噱
噶
噻
噼
嚅
嚊
嚎
嚏
嚒
嚓
嚔
嚛
嚢
嚯
嚰
嚷
嚼
囊
囔
囗
囚
四
囝
回
囟
因
囡
团
団
囤
囫
囬
园
困
囱
围
囵
固
国
图
囿
圆
圈
圜
土
圣
圥
圧
在
圩
圪
圬
地
圳
圴
场
圾
址
坂
均
坊
坌
坍
坎
坏
坐
坑
块
坚
坛
坝
坞
坟
坠
坡
坤
坦
坨
坩
坪
坯
坳
坷
坻
垂
垃
垄
型
垒
垞
垠
垢
垣
垦
垩
垫
垮
垯
垷
垸
埂
埃
埋
城
埔
埘
埙
域
埠
埴
培
基
堂
堆
堕
堞
堡
堤
堪
堰
堵
塌
塑
塔
塘
塞
填
境
墓
増
墙
增
墟
墨
墩
壁
壅
壑
壤
士
壬
壮
声
壳
壶
处
备
変
复
夏
夕
外
夗
多
夜
够
大
天
太
夫
夭
央
失
夲
头
夷
夸
夹
夺
奄
奇
奈
奉
奋
奌
奍
奎
奏
契
奔
奕
奖
套
奘
奚
奢
奥
女
奴
奵
奶
奸
她
好
妁
如
妃
妄
妆
妇
妈
妊
妍
妒
妓
妖
妗
妙
妞
妥
妨
妪
妮
妯
妲
妹
妻
妾
姆
姊
始
姐
姑
姓
委
姙
姚
姜
姝
姟
姣
姥
姨
姬
姲
姸
姻
姿
威
娃
娄
娅
娆
娇
娈
娌
娒
娓
娘
娜
娟
娠
娥
娩
娱
娴
娶
娼
婆
婉
婊
婕
婚
婪
婬
婴
婵
婶
婷
婺
婼
婿
媒
媚
媛
媳
嫁
嫂
嫉
嫌
嫒
嫖
嫚
嫣
嫩
嬉
嬷
孃
子
孑
孓
孔
孕
字
存
孙
孚
孛
孜
孝
孟
孢
季
孤
学
孩
孪
孬
孱
孳
孵
孺
孽
宁
它
宅
宇
守
安
宊
宋
完
宏
宕
宗
官
定
宛
宜
宝
实
宠
审
客
宣
室
宪
宫
宰
害
宴
宵
家
宸
容
宽
宾
宿
寂
寃
寄
密
寇
富
寎
寐
寒
寓
寖
寛
寝
寞
察
寡
寤
寨
寮
寰
寸
对
寺
寻
导
寿
封
射
尅
将
尉
尊
小
少
尓
尔
尕
尖
尘
尚
尝
尤
尧
尬
就
尴
尸
尹
尺
尼
尽
尾
尿
局
屁
层
屄
居
屈
屉
届
屋
屌
屎
屏
屑
展
屙
屛
属
屠
屡
履
屯
山
屹
屺
屿
岀
岁
岂
岌
岐
岑
岔
岖
岗
岙
岚
岛
岢
岩
岬
岭
岱
岳
岵
岷
岸
峋
峙
峞
峡
峣
峤
峩
峪
峭
峰
峻
崀
崁
崂
崃
崇
崎
崔
崖
崛
崣
崤
崩
崭
崴
崽
嵇
嵊
嵌
嵑
嵘
嵩
嵫
嵬
嵴
嶐
嶒
嶙
巅
巍
川
州
巡
巢
巣
工
左
巧
巨
巩
巫
差
巯
己
已
巳
巴
巷
巾
巿
帀
币
市
布
帅
帆
师
希
帐
帕
帖
帘
帚
帛
帝
带
席
帮
帯
常
帽
幅
幌
幔
幕
幢
干
平
年
幵
并
幷
幸
幻
幼
幽
广
庁
庄
庅
庆
庇
床
庋
序
庐
庑
庒
库
应
底
庖
店
庙
庚
府
庝
庞
废
庠
庡
庤
庥
度
座
庭
庵
庶
康
庸
庹
庾
廇
廉
廊
廋
廑
廒
廓
廖
廯
廲
延
廷
建
廾
廿
开
异
弃
弄
弊
弋
式
弓
引
弗
弘
弛
弟
张
弥
弦
弧
弩
弪
弭
弯
弱
弹
强
弾
彉
彊
归
当
录
彗
彝
形
彤
彦
彩
彪
彬
彭
彰
影
彷
役
彻
彼
往
征
径
待
徇
很
徊
律
徐
徒
得
徘
徙
御
徧
徨
循
微
徳
德
徽
心
必
忆
忉
忌
忍
忐
忑
忒
忕
忖
志
忘
忙
忠
忡
忧
忪
快
忱
念
忻
忽
忿
怀
态
怂
怄
怅
怌
怍
怎
怏
怒
怔
怕
怖
怛
怜
思
怠
怡
急
怦
性
怨
怪
怯
怱
怳
怵
总
怼
恁
恋
恍
恐
恒
恕
恙
恚
恟
恢
恣
恤
恨
恩
恫
恬
恭
恮
息
恰
恳
恶
恹
恺
恻
恼
恿
悄
悉
悍
悔
悖
悚
悟
悠
患
悦
您
悬
悲
悳
悴
悸
悼
情
惆
惊
惋
惑
惕
惘
惚
惜
惟
惠
惦
惧
惨
惩
惫
惬
惭
惮
惯
惰
想
惴
惶
惹
惺
愁
愈
愉
愎
意
愕
愚
感
愣
愤
愦
愧
愫
愰
愽
愿
慈
慉
慌
慎
慑
慕
慝
慢
慧
慨
慰
慵
慷
慼
慾
憋
憎
憔
憧
憨
憩
憬
憷
憾
懂
懆
懈
懊
懒
懝
懡
懦
懵
懿
戈
戊
戌
戍
戎
戏
成
我
戒
戓
或
戗
战
戚
戛
戟
截
戳
戴
户
房
所
扁
扇
扉
手
扌
才
扎
扑
扒
打
扔
托
扛
扞
扣
扤
扥
扦
执
扩
扪
扫
扬
扭
扮
扯
扰
扱
扳
扴
扶
批
扼
扽
找
承
技
抄
抉
把
抑
抒
抓
投
抖
抗
折
抚
抛
抟
抠
抡
抢
抣
护
报
抨
披
抬
抱
抵
抹
抺
抻
押
抽
抿
拂
拄
担
拆
拇
拈
拉
拌
拍
拎
拐
拒
拓
拔
拖
拗
拘
拙
拚
招
拜
拟
拢
拣
拥
拦
拧
拨
择
括
拭
拮
拯
拱
拳
拴
拷
拼
拽
拾
拿
持
挂
指
挈
按
挍
挎
挑
挖
挚
挛
挞
挟
挠
挡
挣
挤
挥
挨
挪
挫
挭
振
挰
挷
挺
挻
挽
挿
捂
捄
捅
捆
捉
捋
捌
捍
捎
捏
捐
捕
捞
损
捡
换
捣
捧
据
捱
捶
捷
捺
捻
捽
掀
掁
掂
掇
授
掉
掌
掏
掐
排
掖
掘
探
掤
接
控
推
掩
措
掰
掱
掳
掴
掷
掺
掻
掾
掿
揉
揍
描
提
插
揖
揠
握
揣
揩
揪
揭
援
揷
揺
揽
搀
搁
搂
搅
搏
搐
搓
搔
搜
搞
搡
搦
搪
搬
搭
携
搽
摁
摄
摆
摇
摈
摊
摍
摒
摔
摘
摤
摧
摩
摸
撅
撇
撑
撒
撕
撞
撤
撩
撬
播
撮
撵
撷
撸
撺
撼
擀
擂
擅
操
擞
擤
擦
攀
攒
攘
攥
支
攴
收
改
攻
放
政
故
效
敌
敏
救
敕
敖
教
敛
敝
敞
敢
散
敦
敬
数
敲
整
敷
文
斋
斌
斐
斑
斓
斗
料
斛
斜
斟
斤
斥
斩
断
斯
新
方
施
旁
旅
族
旒
旗
无
旡
既
日
旦
旧
旨
早
旪
旬
旭
旮
旰
旱
旳
时
旷
旸
旺
昁
昂
昆
昊
昌
明
昏
易
昔
昕
昙
星
映
春
昧
昨
昩
昬
昭
是
昰
昱
昵
昶
昹
昼
显
晃
晄
晋
晌
晏
晒
晓
晕
晖
晚
晟
晡
晢
晣
晥
晦
晨
晩
普
景
晰
晴
晶
智
晾
暂
暇
暑
暖
暗
暜
暧
暨
暮
暴
曙
曜
曝
曦
曩
曰
曱
曲
曳
更
曹
曼
曽
曾
替
最
朂
月
有
朊
朋
朌
服
朐
朔
朕
朗
望
朝
期
朦
木
朩
未
末
本
札
术
朱
朴
朵
朶
朷
机
杀
杂
权
杄
杆
杉
杌
李
杏
材
村
杓
杖
杜
杞
束
杠
条
来
杨
杭
杯
杰
杲
杳
杵
杷
松
板
极
构
枇
枉
枋
枌
析
枕
林
枘
枚
果
枝
枞
枢
枣
枤
枪
枫
枯
枳
架
枷
枸
柀
柄
柏
某
柑
柒
染
柔
柘
柚
柜
柝
柞
柠
查
柦
柬
柯
柱
柳
柴
柺
査
柿
栀
栅
栆
标
栋
栏
树
栓
栗
栘
校
株
栳
样
核
根
格
栽
栾
桂
桃
桅
框
案
桉
桌
桐
桑
桓
桔
桖
桡
档
桥
桦
桧
桨
桩
桭
桶
梁
梃
梅
梆
梗
梢
梦
梧
梨
梭
梯
械
梳
检
棈
棉
棋
棍
棑
棒
棕
棘
棚
棠
森
棱
棵
棺
椅
植
椎
椐
椒
椭
椰
椴
椹
椿
楂
楔
楕
楖
楚
楝
楞
楠
楡
楣
楬
楷
楼
概
榄
榆
榈
榉
榍
榒
榔
榕
榙
榛
榜
榧
榨
榭
榱
榴
榷
榻
槁
槐
槛
槟
槭
槮
槯
槲
槺
槽
樊
樕
樟
模
横
樱
樵
橄
橇
橘
橙
橛
橡
橱
橹
橼
檀
檐
檗
檫
檬
檵
檽
櫈
欠
次
欢
欣
欤
欧
欲
欶
欺
款
歇
歉
歌
止
正
此
步
武
歧
歨
歩
歪
歳
歹
歺
死
歼
殃
殇
殊
残
殒
殓
殖
殡
殳
殴
段
殷
殿
毁
毅
毉
毋
毌
母
毎
每
毒
毓
比
毕
毙
毛
毡
毫
毯
氅
氏
氐
民
氓
气
氙
氚
氛
氟
氡
氢
氦
氧
氨
氩
氮
氯
氰
氲
水
氵
氷
永
氺
氻
氾
汀
汁
求
汇
汉
汍
汐
汔
汕
汗
汘
汚
汝
汞
江
池
污
汢
汤
汪
汰
汲
汶
汹
汽
汾
沁
沂
沃
沅
沉
沌
沏
沐
沓
沙
沚
沛
沟
没
沤
沥
沦
沧
沪
沫
沬
沭
沮
河
沴
沷
沸
油
治
沼
沽
沾
沿
泄
泉
泊
泌
泓
泔
法
泗
泛
泠
泡
波
泣
泥
注
泩
泪
泫
泮
泯
泰
泳
泵
泷
泸
泻
泼
泽
泾
洁
洋
洌
洐
洒
洗
洛
洞
津
洪
洫
洮
洱
洲
洵
洷
活
洼
洽
派
流
浃
浄
浅
浆
浇
浊
测
济
浏
浑
浓
浙
浚
浠
浦
浩
浪
浮
浴
海
浸
涂
消
涉
涌
涎
涐
涑
涔
涕
涛
涝
涟
涡
涣
涤
润
涧
涨
涩
涪
涮
涯
涱
液
涵
涸
涿
淀
淄
淅
淆
淇
淋
淌
淑
淖
淘
淞
淡
淤
淧
淫
淮
深
淲
淳
混
淸
淹
添
淼
清
渊
渌
渍
渎
渐
渔
渗
渚
渝
渠
渡
渣
渤
渧
温
渫
渭
港
渲
渴
游
渺
湃
湄
湍
湓
湖
湘
湛
湥
湫
湮
湼
湾
湿
溃
溅
溉
溏
源
溜
溢
溥
溦
溧
溪
溱
溲
溴
溶
溺
滁
滂
滋
滑
滓
滔
滕
滚
滛
滞
满
滤
滥
滦
滨
滩
滳
滴
滶
漂
漅
漆
漉
漏
漓
演
漕
漟
漠
漩
漫
漯
漱
漳
漹
漾
潄
潇
潍
潘
潜
潞
潢
潦
潧
潭
潮
潴
潼
澄
澈
澌
澎
澜
澡
澧
澳
激
濑
濒
濞
濡
濮
瀑
瀛
灌
火
灬
灭
灯
灰
灵
灶
灸
灼
灾
灿
炀
炅
炆
炉
炎
炒
炔
炕
炖
炙
炜
炤
炫
炬
炭
炮
炯
炳
炷
炸
点
炻
炼
炽
烀
烁
烂
烃
烈
烊
烘
烙
烛
烟
烤
烦
烧
烩
烫
热
烯
烷
烹
烽
焄
焉
焊
焐
焑
焕
焖
焙
焚
焦
焯
焰
焱
焲
然
焼
煅
煊
煌
煎
煓
煜
煞
煤
煦
照
煨
煮
煲
煸
煽
熄
熊
熏
熔
熙
熟
熨
熬
燃
燎
燕
燥
燧
爆
爪
爬
爰
爱
爵
父
爷
爸
爹
爽
片
版
牌
牒
牙
牛
牟
牡
牢
牦
牧
物
牯
牲
牵
特
牺
犀
犁
犄
犒
犟
犬
犮
犯
状
犷
犹
狂
狄
狈
狌
狍
狐
狗
狞
狠
狡
狨
独
狭
狮
狰
狱
狸
狻
狼
猎
猓
猕
猖
猗
猛
猜
猝
猥
猩
猪
猫
猬
猭
献
猴
猾
猿
獊
獐
獗
獭
獾
玄
率
玉
王
玌
玍
玏
玖
玛
玟
玢
玥
玧
玩
玫
玮
环
现
玲
玸
玹
玻
珀
珂
珈
珉
珊
珍
珑
珙
珠
班
珮
珲
球
琅
理
琉
琏
琐
琚
琛
琢
琥
琦
琪
琰
琳
琴
琵
琶
琼
瑆
瑔
瑕
瑚
瑜
瑞
瑟
瑰
瑳
瑶
瑿
璃
璄
璇
璐
璘
璜
璞
璧
瓘
瓜
瓟
瓠
瓢
瓣
瓤
瓦
瓮
瓶
瓷
甄
甘
甙
甚
甜
生
甥
用
甩
甫
甭
田
由
甲
申
电
男
甸
町
画
甾
畀
畅
界
畏
畔
留
畛
畜
略
畧
番
畴
畸
疆
疏
疑
疒
疔
疖
疗
疙
疚
疝
疟
疠
疡
疣
疤
疥
疫
疬
疮
疯
疱
疲
疳
疴
疵
疸
疹
疺
疼
疽
疾
疿
痂
痃
病
症
痈
痉
痊
痒
痓
痔
痕
痖
痘
痛
痞
痠
痢
痣
痤
痦
痧
痨
痩
痪
痫
痰
痱
痲
痳
痴
痹
痺
痿
瘀
瘁
瘆
瘉
瘊
瘐
瘕
瘘
瘙
瘚
瘛
瘟
瘢
瘤
瘥
瘦
瘨
瘩
瘪
瘫
瘰
瘳
瘴
瘶
瘸
瘼
瘾
瘿
癀
癃
癌
癍
癎
癒
癓
癔
癖
癜
癞
癣
癫
癸
登
白
百
癿
皁
皂
皃
的
皆
皇
皋
皖
皙
皮
皱
皲
皴
皿
盂
盅
盆
盈
益
盍
盎
盏
盐
监
盒
盔
盖
盗
盘
盛
盟
盥
目
盯
盰
盱
盲
直
相
盹
盼
盾
眀
省
眂
眉
看
眘
眙
真
眠
眢
眦
眨
眩
眬
眯
眵
眶
眷
眼
着
睁
睇
睉
睌
睐
睑
睛
睠
睡
睢
督
睥
睦
睪
睫
睬
睲
睹
睾
睿
瞄
瞅
瞌
瞎
瞑
瞒
瞖
瞙
瞟
瞠
瞥
瞧
瞩
瞪
瞬
瞮
瞳
瞻
瞿
矗
矛
矢
矣
知
矩
矫
矬
短
矮
石
矶
矸
矾
矿
码
砂
砄
砆
砌
砍
砒
研
砖
砗
砜
砟
砣
砥
砩
砰
砲
破
砵
砷
砸
砹
砺
砼
砾
础
硅
硌
硐
硒
硕
硖
硝
硧
硪
硫
硬
确
硼
碄
碇
碌
碍
碎
碑
碓
碗
碘
碚
碜
碟
碧
碰
碱
碲
碳
碴
碾
磁
磅
磊
磋
磐
磕
磙
磨
磷
磺
礁
礓
礞
礠
示
礼
社
礿
祁
祈
祓
祖
祘
祛
祝
神
祟
祢
祥
票
祭
祷
祸
祺
禀
禁
禄
禅
福
禑
禔
禧
禳
禹
禺
离
禽
禾
秀
私
秃
秉
秋
种
科
秒
秘
租
秤
秥
秦
秧
秩
积
称
秸
移
秽
稀
程
稍
税
稔
稚
稞
稠
稳
稷
稹
稻
稼
稽
稿
穆
穈
穏
穑
穗
穴
究
穷
穹
空
穿
突
窃
窄
窍
窑
窒
窖
窗
窘
窜
窝
窟
窠
窥
窦
窿
立
竖
站
竞
竟
章
竣
童
竭
端
竹
竿
笃
笄
笆
笊
笋
笏
笑
笒
笔
笕
笙
笛
笥
符
笨
笫
第
笱
笼
等
筋
筐
筑
筒
答
策
筛
筝
筯
筵
筷
筹
筽
签
简
箍
箐
箕
算
箘
管
箩
箭
箱
箴
箹
篇
篓
篜
篮
篱
篷
篸
簇
簌
簟
簧
簸
簿
籍
米
类
籽
粉
粑
粒
粗
粘
粟
粢
粤
粥
粨
粪
粮
粱
粲
粳
粹
粽
精
粿
糊
糍
糕
糖
糗
糙
糜
糟
糠
糢
糥
糨
糯
糸
系
糼
紊
素
索
紧
紫
累
絮
絯
綦
緍
緖
縻
繁
繴
纠
纡
红
纣
纤
约
级
纪
纫
纬
纭
纯
纱
纲
纳
纵
纶
纷
纸
纹
纺
纽
纾
线
绀
练
组
绅
细
织
终
绉
绊
绍
经
绐
绑
绒
结
绕
绖
绘
给
绛
络
绝
绞
统
绡
绢
绣
绥
绦
继
绩
绪
续
绮
绯
绰
绳
维
绵
绶
绷
绸
绺
综
绿
缀
缃
缄
缅
缆
缌
缎
缐
缓
缔
缕
编
缘
缙
缚
缝
缠
缢
缤
缩
缪
缬
缭
缮
缰
缴
缸
缺
罂
罅
罐
网
罒
罕
罗
罚
罡
罢
罩
罪
置
署
罹
罾
羁
羊
羌
美
羔
羙
羚
羝
羞
羟
羡
群
羧
羸
羹
羽
羿
翁
翅
翔
翘
翟
翠
翡
翩
翱
翳
翻
翼
耀
老
考
耄
者
耆
耋
而
耍
耐
耒
耕
耗
耘
耙
耦
耪
耱
耳
耵
耶
耷
耸
耻
耽
耿
聂
聆
聊
聋
职
聍
联
聘
聚
聛
聪
肃
肆
肇
肉
肋
肌
肎
肏
肓
肖
肘
肙
肚
肛
肝
肟
肠
股
肢
肤
肥
肧
肩
肪
肭
肮
肯
肰
肱
育
肴
肺
肼
肽
肾
肿
胀
胁
胃
胄
胆
背
胍
胎
胓
胖
胚
胛
胜
胝
胞
胠
胡
胥
胧
胨
胩
胪
胫
胬
胯
胰
胱
胲
胳
胴
胶
胸
胺
胼
能
脂
脆
脉
脊
脍
脏
脐
脑
脒
脓
脔
脕
脖
脘
脚
脞
脢
脥
脧
脬
脯
脰
脱
脲
脷
脸
脾
腂
腄
腆
腊
腋
腌
腐
腑
腓
腔
腕
腘
腙
腚
腣
腥
腩
腭
腮
腰
腱
腹
腺
腻
腼
腾
腿
膀
膄
膈
膊
膏
膑
膓
膘
膛
膜
膝
膣
膦
膨
膭
膳
膴
膸
膻
臀
臁
臂
臃
臆
臊
臑
臗
臣
臧
自
臭
至
致
臻
臼
舀
舂
舅
舆
舌
舍
舐
舒
舔
舛
舜
舞
舟
舨
航
般
舯
舰
舱
舵
船
艘
艮
良
艰
色
艳
艺
艽
艾
艿
节
芄
芊
芋
芍
芎
芏
芐
芑
芒
芘
芙
芜
芝
芡
芤
芥
芦
芧
芨
芩
芪
芫
芬
芭
芮
芯
花
芳
芷
芸
芹
芽
芾
苁
苃
苄
苇
苈
苋
苍
苏
苐
苑
苓
苔
苕
苖
苗
苛
苞
苟
苡
苣
苤
若
苦
苧
苯
英
苶
苷
苹
苻
茁
茂
范
茄
茅
茉
茋
茌
茎
茏
茛
茜
茧
茨
茫
茬
茭
茯
茱
茴
茵
茶
茸
茹
茼
荀
荃
荄
荆
草
荎
荐
荑
荒
荔
荚
荜
荞
荟
荠
荡
荣
荤
荥
荧
荨
荩
荫
荭
荮
药
荷
荸
荼
荽
莄
莆
莉
莎
莒
莓
莘
莜
莝
莞
莨
莪
莫
莱
莲
莴
获
莹
莿
菁
菅
菇
菊
菌
菏
菓
菔
菖
菗
菜
菝
菟
菠
菥
菩
菪
菰
菱
菲
菴
萃
萄
萆
萌
萍
萎
萘
萝
萤
营
萦
萧
萨
萱
萸
萼
落
葆
葎
葙
葚
葛
葜
葡
董
葩
葫
葬
葱
葵
葶
蒂
蒄
蒋
蒌
蒎
蒗
蒙
蒜
蒡
蒲
蒸
蒺
蒽
蒿
蓂
蓃
蓄
蓉
蓑
蓓
蓖
蓝
蓟
蓤
蓬
蓼
蔌
蔑
蔓
蔕
蔗
蔚
蔡
蔨
蔫
蔬
蔺
蔻
蔼
蔽
蕃
蕈
蕉
蕊
蕙
蕡
蕨
蕴
蕾
薄
薇
薏
薛
薢
薤
薪
薬
薯
薰
薹
藁
藏
藓
藕
藜
藠
藤
藻
藿
蘑
蘖
蘘
蘸
虎
虐
虑
虚
虞
虣
虫
虱
虹
虻
虽
虾
蚀
蚁
蚂
蚊
蚌
蚓
蚕
蚝
蚣
蚤
蚧
蚪
蚬
蚯
蚱
蚴
蛀
蛆
蛇
蛊
蛋
蛎
蛏
蛔
蛙
蛛
蛟
蛤
蛭
蛮
蛰
蛲
蛳
蛸
蛹
蛾
蜀
蜂
蜃
蜇
蜈
蜊
蜍
蜒
蜕
蜖
蜗
蜘
蜚
蜜
蜡
蜢
蜥
蜱
蜴
蜷
蜿
蝇
蝉
蝌
蝎
蝗
蝙
蝠
蝣
蝥
蝮
蝴
蝶
蝻
蝼
螂
螃
螅
融
螔
螚
螨
螫
螬
螯
螵
螺
蟅
蟆
蟊
蟑
蟒
蟓
蟗
蟠
蟥
蟹
蟾
蠕
蠢
蠲
蠹
血
衄
衅
行
衍
衔
街
衙
衞
衡
衢
衣
补
表
衩
衫
衬
衰
衲
衷
袁
袄
袋
袍
袒
袖
袛
袜
袢
袪
被
袭
袱
裁
裂
装
裆
裕
裘
裙
裢
裤
裨
裳
裴
裸
裹
裼
裾
褐
褒
褔
褥
褪
褶
襄
襞
襟
襻
襾
西
要
覃
覅
覆
覚
见
观
规
觅
视
览
觉
角
觚
觜
解
触
觧
觪
言
詃
詹
誉
誓
誫
警
譬
计
订
认
讥
讦
讨
让
讬
训
议
讯
记
讲
讳
讶
讷
许
讹
论
讽
设
访
诀
证
诂
诃
评
识
诈
诉
诊
诌
词
译
诒
诓
试
诗
诚
诜
话
诞
诟
诡
询
诣
该
详
诧
诫
语
诮
误
诰
诱
说
诵
诶
请
诸
诺
读
课
诿
谁
调
谅
谆
谈
谊
谋
谎
谏
谐
谑
谓
谖
谗
谘
谙
谛
谜
谟
谢
谣
谦
谧
谨
谩
谭
谮
谱
谴
谵
谶
谷
豁
豆
豇
豉
豌
豚
象
豪
豫
豹
貂
貌
贝
贞
负
贡
财
责
贤
败
账
货
质
贩
贪
贫
贬
购
贮
贯
贰
贱
贲
贴
贵
贷
贸
费
贺
贻
贼
贽
贾
贿
赃
资
赅
赈
赉
赋
赌
赎
赏
赐
赔
赖
赘
赚
赛
赞
赠
赡
赢
赣
赤
赫
赭
走
赴
赵
赶
起
趁
趄
超
趈
越
趋
趔
趟
趣
足
趴
趺
趾
跃
跄
跆
跋
跌
跎
跏
跑
跖
跗
跚
跛
距
跞
跟
跤
跨
跪
路
跳
践
跶
跷
跹
跺
跻
踉
踊
踏
踔
踝
踟
踢
踩
踪
踫
踮
踱
踵
踹
踺
蹀
蹄
蹈
蹉
蹋
蹒
蹙
蹟
蹠
蹦
蹩
蹬
蹭
蹰
蹲
蹴
蹶
蹼
蹾
蹿
躁
身
躬
躯
躰
躲
躺
车
轧
轨
轩
转
轮
软
轰
轱
轴
轻
载
轾
轿
辁
较
辄
辅
辆
辈
辉
辍
辐
辑
输
辖
辗
辘
辙
辛
辜
辞
辟
辠
辣
辧
辨
辩
辫
辬
辰
辱
辶
边
辽
达
迀
迁
迂
迄
迅
过
迈
迎
运
近
返
迖
还
这
进
远
违
连
迟
迤
迦
迩
迪
迫
迭
迮
述
迳
迷
迸
迹
迼
追
退
送
适
逃
逆
选
逊
逍
透
逐
递
途
逗
通
逛
逝
逞
速
造
逡
逢
逮
逯
逶
逸
逻
逼
逾
遁
遂
遇
遍
遏
道
遗
遛
遢
遣
遥
遭
遮
遵
避
邀
邃
邋
邑
邓
邕
邚
邛
邡
邢
那
邦
邪
邮
邯
邱
邳
邵
邸
邹
邻
郁
郊
郎
郏
郑
郓
郚
郛
郜
郝
郢
郧
部
郫
郭
郯
郴
郸
都
郾
鄀
鄂
鄙
鄞
鄢
鄯
酉
酊
酌
配
酐
酒
酗
酚
酞
酣
酤
酥
酦
酩
酪
酫
酬
酮
酯
酰
酱
酲
酵
酶
酷
酸
酿
醇
醉
醋
醌
醍
醎
醒
醚
醛
醣
醪
醯
醴
醺
釆
采
釉
释
里
重
野
量
金
鈡
鉄
鉏
鉴
鎏
鏉
鐥
鑫
钅
钆
针
钉
钍
钎
钏
钓
钕
钗
钙
钛
钜
钝
钞
钟
钠
钡
钢
钣
钥
钦
钧
钨
钩
钪
钬
钭
钮
钯
钱
钲
钳
钴
钸
钻
钼
钾
铀
铁
铂
铃
铅
铇
铊
铋
铍
铎
铐
铛
铜
铝
铡
铣
铨
铬
铭
铮
铰
铲
铴
铵
银
铸
铺
链
铿
销
锁
锂
锃
锄
锅
锇
锈
锉
锋
锌
锏
锐
锒
锓
锕
错
锝
锡
锢
锣
锤
锥
锦
锨
锭
键
锯
锰
锵
锶
锷
锺
锻
镀
镁
镂
镆
镇
镈
镉
镊
镍
镏
镘
镚
镛
镜
镟
镨
镫
镭
镯
镰
镱
镳
镶
镸
长
閟
门
闪
闫
闭
问
闯
闰
闱
闲
间
闵
闷
闸
闹
闺
闻
闽
闾
阀
阁
阂
阅
阆
阈
阉
阎
阏
阐
阑
阔
阖
阙
阜
阝
队
阡
阮
阰
阱
防
阳
阴
阵
阶
阻
阿
陀
陂
附
际
陆
陇
陈
陉
陋
陌
降
陏
限
陔
陕
陟
陡
院
除
陨
险
陪
陵
陶
陷
隂
隅
隆
隋
随
隐
隔
隙
障
隧
隶
隹
隽
难
雀
雁
雄
雅
集
雇
雌
雍
雕
雨
雪
雳
零
雷
雹
雾
需
霄
霆
震
霉
霍
霓
霖
霜
霞
霭
霰
露
霸
霹
霾
靑
青
靓
靖
静
非
靟
靠
靡
面
靣
革
靳
靴
靶
鞋
鞍
鞘
鞠
鞣
鞥
鞭
鞴
韦
韧
韩
韭
音
韵
韶
頚
頬
顣
页
顶
顷
顸
项
顺
须
顼
顽
顾
顿
颁
颂
预
颅
领
颇
颈
颊
颌
颏
颐
频
颓
颔
颖
颗
题
颚
颜
额
颞
颠
颤
颦
颧
风
飕
飘
飙
飚
飞
食
飧
飨
餐
饔
饥
饨
饪
饭
饮
饯
饰
饱
饲
饴
饵
饶
饷
饹
饺
饼
饿
馀
馁
馄
馅
馆
馇
馈
馊
馋
馍
馏
馐
馒
馔
馕
首
馘
香
馥
馨
马
驭
驮
驯
驰
驱
驳
驴
驶
驹
驻
驼
驽
驾
骁
骂
骄
骅
骆
骇
骊
骋
验
骑
骗
骚
骝
骡
骤
骥
骨
骰
骱
骶
骷
骸
骹
骺
骻
骼
髁
髂
髄
髅
髋
髌
髓
高
髙
髦
髯
鬓
鬲
鬼
魁
魂
魄
魅
魇
魏
魔
鮸
鯹
鱼
鱿
鲁
鲅
鲆
鲈
鲍
鲑
鲜
鲤
鲨
鲫
鲮
鲳
鲶
鲸
鳃
鳄
鳅
鳌
鳍
鳔
鳕
鳖
鳗
鳘
鳝
鳞
鶑
鶒
鸟
鸠
鸡
鸣
鸦
鸪
鸬
鸭
鸽
鸿
鹅
鹆
鹉
鹊
鹌
鹏
鹑
鹞
鹤
鹦
鹧
鹰
鹾
鹿
麂
麋
麒
麓
麝
麟
麦
麭
麸
麻
麿
黄
黎
黏
黑
黒
黔
默
黛
黝
黧
黯
黾
鼎
鼐
鼓
鼠
鼻
鼾
齁
齐
齢
齿
龃
龄
龅
龆
龇
龈
龊
龋
龌
龙
龚
龛
龟



凉
︷
﹉
﹍
﹏
﹐
﹑
﹔
﹕
﹖
﹗
﹞
﹟
﹡
﹣
﹪
＂
＃
＇
＊
．
／
＜
＝
＞
＠
［
］
＾
＿
｀
￣